
		     An Emacs configuration tour

#+startup: overview
#+language: en
#+drawers: PROPERTIES FEEDSTATUS
#+filetags: emacs
#+todo: TODO | DONE CANCELED
#+style: <link rel="stylesheet" type="text/css" href="css/clean.css" />
#+options: H:2 toc:nil todo:t email:t ^:nil

** Extending Emacs, packages repositories, etc

The easiest way to extend Emacs features is to use =list-package= and
install packages from remote repositories. But =package.el= is rather
new and not all libraries are available in the form of packages. When
a library must be installed by hand, a good practice is to always put
it in the directory =~/.emacs.d=. The load path is extended
accordingly.

#+begin_src emacs-lisp :tangle .emacs
(add-to-list 'load-path (expand-file-name "~/.emacs.d/"))
#+end_src

The default is to fetch packages from the GNU Emacs packages
repository. There are usefull packages in other places like [[http://tromey.com/elpa/][ELPA]] and
[[http://marmalade-repo.org/][Marmalade]].

#+begin_src emacs-lisp :tangle .emacs
(eval-after-load "package"
  '(progn
     (add-to-list 'package-archives '("elpa" . "http://tromey.com/elpa/"))
     (add-to-list 'package-archives '("marmalade". "http://marmalade-repo.org/packages/"))))
(package-initialize)
#+end_src

At the time of writing, I have activated the following packages:

#+begin_src emacs-lisp :exports results :results value raw
(let ((descriptions "|Package|Description|\n|---|\n"))
  (dolist (package package-alist descriptions)
    (let ((name (car package))
	  (desc (aref (cdr package) 2)))
    (setq descriptions 
	  (concat descriptions (format "|%s|%s|\n" name desc))))))
#+end_src

#+RESULTS:
| Package               | Description                                        |
|-----------------------+----------------------------------------------------|
| virtualenv            | Virtualenv for Python  -*- coding: utf-8 -*-       |
| symbols-mode          | List symbols of object files                       |
| php-mode              | major mode for editing PHP code                    |
| htmlize               | Convert buffer text and decorations to HTML.       |
| graphviz-dot-mode     | Mode for the dot-language used by graphviz (att).  |
| gnuplot               | drive gnuplot from within emacs                    |
| doctags               | Generation of tags documentation in Doxygen syntax |
| dictionary            | an interface to an RFC 2229 dictionary server      |
| color-theme-solarized | Solarized themes for Emacs                         |

All settings written using the customize library go to a dedicated
file that is loaded when the loading of the file file:.emacs ends.

#+begin_src emacs-lisp :noweb yes
<<.emacs_custom-file_loading>>
#+end_src

When the custom settings are loaded, a machine specific file is
loaded. The file name comes from the host name of the machine Emacs is
running on.

#+begin_src emacs-lisp :noweb yes
<<.emacs_system-name_loading>>
#+end_src

